Revit 2015 API
Segment Class
 This element represents a segment of an MEP curve object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
public class Segment : Element
Visual Basic
Public Class Segment _
	Inherits Element
Visual C++
public ref class Segment : public Element
Remarks
 Currently, only pipe curves can be broken into separate segment elements.
Examples
CopyVB.NET
Private Sub GetPipeSegmentSizesFromDocument(document As Document)
    Dim collectorPipeType As New FilteredElementCollector(document)
    collectorPipeType.OfClass(GetType(Segment))
    Dim segments As IEnumerable(Of Segment) = collectorPipeType.ToElements().Cast(Of Segment)()
    For Each segment As Segment In segments
        Dim strPipeInfo As New StringBuilder()
        strPipeInfo.AppendLine("Segment: " + segment.Name)
        strPipeInfo.AppendLine("Roughness: " + segment.Roughness)
        strPipeInfo.AppendLine("Pipe Sizes:")
        Dim dLengthFac As Double = 304.8
        ' used to convert stored units from ft to mm for display
        For Each size As MEPSize In segment.GetSizes()
            strPipeInfo.AppendLine(String.Format("Nominal: {0:F3}, ID: {1:F3}, OD: {2:F3}", size.NominalDiameter * dLengthFac, size.InnerDiameter * dLengthFac, size.OuterDiameter * dLengthFac))
        Next
        TaskDialog.Show("PipeSetting Data", strPipeInfo.ToString())
        Exit For
    Next
End Sub
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Segment
 Autodesk.Revit.DB.Plumbing.PipeSegment
See Also
Segment Members
Autodesk.Revit.DB Namespace